InformationRegisters/ЛБ_СогласияНаОбработкуПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СогласияНаОбработкуПД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыСоглашенийПД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СогласияНаОбработкуПД_ЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СогласияНаОбработкуПД_ЗБ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыСоглашенийПД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыСоглашенийПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыСоглашенийПД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Получено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПолучено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДокументовЗалогодателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийПравоПребыванияРФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЛБ_СогласияНаОбработкуПД_Сервер/Ext/Module.bsl
#Область ДанныеДляПечати

Функция ПечатьСогласиеНаОбработкуПД(Клиент) Экспорт 
	
	СтруктураДанных = ПолучитьДанныеДляПечатиСогласияНаОбработкуПД(Клиент);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
		
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СогласиеНаОбработкуПД_ЭДО";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_СогласиеНаОбработкуПД_ЭДО");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьТекст   = Макет.ПолучитьОбласть("ТекстСогласия");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ОбластьТекст.Параметры.Заполнить(СтруктураДанных);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьТекст);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьСогласиеНаОбработкуПД_ЗБ(ОперацияЗайма) Экспорт 
	
	СтруктураДанных = ПолучитьДанныеДляПечатиСогласияНаОбработкуПД_ЗБ(ОперацияЗайма);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
		
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СогласиеНаОбработкуПД_ЗБ";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_СогласиеНаОбработкуПД_Займ");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьТекст   = Макет.ПолучитьОбласть("ТекстСогласия");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ОбластьТекст.Параметры.Заполнить(СтруктураДанных);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьТекст);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьОтзываСогласияНаОбработкуПД(Клиент) Экспорт 
	
	СтруктураДанных = ПолучитьДанныеДляПечатиОтзываСогласияНаОбработкуПД(Клиент);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтзывПД";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ОтзывСогласияНаОбработкуПД");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьТекст     = Макет.ПолучитьОбласть("ТекстОтзыва");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ОбластьТекст.Параметры.Заполнить(СтруктураДанных);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьТекст);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьСогласияНаОпробование(Клиент) Экспорт 
	
	СтруктураДанных = ПолучитьДанныеДляПечатиСогласияНаОпробование(Клиент);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СогласияНаОпробование";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_СогласиеНаОпробованиеИзделия");
	
	ОбластьШапкаПД     = Макет.ПолучитьОбласть("ШапкаСогласияПД");
	ОбластьТекстПД     = Макет.ПолучитьОбласть("ТекстСогласияПД");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьТекст     = Макет.ПолучитьОбласть("ТекстСогласия");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапкаПД.Параметры.Заполнить(СтруктураДанных);
	ОбластьТекстПД.Параметры.Заполнить(СтруктураДанных);
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ОбластьТекст.Параметры.Заполнить(СтруктураДанных);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	
	ТабличныйДокумент.Вывести(ОбластьШапкаПД);
	ТабличныйДокумент.Вывести(ОбластьТекстПД);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьТекст);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатиСогласияНаОбработкуПД(Клиент) Экспорт
	
	Структура = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Период КАК Период,
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаОбработкуПД.СрезПоследних(
		|			&Период,
		|			Статус = &Статус
		|				И НЕ Ошибочное) КАК ЛБ_СогласияНаОбработкуПДСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСоглашенийПД.Получено);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСреза     = Выборка.Период;
		Ломбард       = Выборка.Ломбард;
		Ответственный = Выборка.Ответственный;
	КонецЕсли;
		
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ломбард.ПолучитьОбъект(),,ДатаСреза);
	СтруктураАдреса = фПрочитатьJSON(Ломбард.КонтактнаяИнформация[0].Значение);
	Структура.Вставить("Город",                         "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, ""));
	Структура.Вставить("Дата",                ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));
	Структура.Вставить("АдресОрганизации",              ?(ЗначениеЗаполнено(СведенияОбОрганизации.АдресОрганизации),
	                                                    СведенияОбОрганизации.АдресОрганизации, ""));
	Структура.Вставить("ИНН",                           ?(ЗначениеЗаполнено(Организация.ИНН), Организация.ИНН, ""));
	Структура.Вставить("ОГРН",                          ?(ЗначениеЗаполнено(Организация.ОГРН), Организация.ОГРН, ""));
	//Структура.Вставить("ПочтаОрганизации",              СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации);
	//Структура.Вставить("ТелефонОрганизации",            СведенияОбОрганизации.ТелефонОрганизации);
	
	Структура.Вставить("Ломбард",                       ?(ЗначениеЗаполнено(Ломбард), Строка(Ломбард), ""));
	Структура.Вставить("АдресЛомбарда",                 СтруктураАдреса.value);
	Структура.Вставить("ТелефонЛомбарда",               "");
	Структура.Вставить("ДатаЭДО",                       Формат(ДатаСреза, "ДФ=dd.MM.yyyy"));
	ДолжностьОтветственного                             = ДолжностьОтветственного(Ответственный, ДатаСреза);
	СклонениеДолжностиОтветственного                    = ПолучитьСклоненияСтроки(Строка(ДолжностьОтветственного), , "ПД=Родительный");
	//Структура.Вставить("ДолжностьОтветственногоВПадеже",     ?(ЗначениеЗаполнено(СклонениеДолжностиОтветственного[0]), 
	//                                                    НРег(?(СклонениеДолжностиОтветственного.Количество() > 0, СклонениеДолжностиОтветственного[0], "")), ""));
	Структура.Вставить("ДолжностьОтветственного",       ?(ЗначениеЗаполнено(ДолжностьОтветственного), Строка(ДолжностьОтветственного), ""));
	ФИООтветственного                                   = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	СклонениеФамилииОтветственного                      = ПолучитьСклоненияСтроки(ФамилияОтветственного, , "ПД=Родительный");
	ФамилияОтветственногоВПадеже                        = ?(СклонениеФамилииОтветственного.Количество() > 0, СклонениеФамилииОтветственного[0], "");
	
	//Структура.Вставить("ФамилияИнициалыОтветственногоВПадеже",ФамилияОтветственногоВПадеже + " " + ИнициалыОтветственного);
	Структура.Вставить("ФИООтветственного", ФамилияОтветственного + " " + ИнициалыОтветственного);
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	
	ДанныеПравоПребывания                               = ДанныеПравоПребывания(Клиент, ДатаСреза);
	
    Структура.Вставить("ДанныеПравоПребывания",         ?(ЗначениеЗаполнено(ДанныеПравоПребывания.ДанныеПравоПребывания),
		ДанныеПравоПребывания.ДанныеПравоПребывания + ". ", ""));
		
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("ТелефонКлиента",                ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Телефон), 
	                                                    КонтактнаяИнформацияКлиента.Телефон, ""));
	Структура.Вставить("ПочтаКлиента",                  ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Email),
	                                                                КонтактнаяИнформацияКлиента.Email, "нет"));
	Структура.Вставить("ФамилияИнициалыКлиента",        ДанныеКлиента.Фамилия + " " + Лев(ДанныеКлиента.Имя, 1) + "." + Лев(ДанныеКлиента.Отчество, 1) + ".");
	
	Возврат Структура;
КонецФункции

Функция ПолучитьДанныеДляПечатиОтзываСогласияНаОбработкуПД(Клиент) Экспорт
	
	Структура = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Период КАК Период,
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаОбработкуПД.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И Статус = &Статус
		|				И НЕ Ошибочное) КАК ЛБ_СогласияНаОбработкуПДСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСоглашенийПД.Отозвано);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСреза     = Выборка.Период;
		Ломбард       = Выборка.Ломбард;
		Ответственный = Выборка.Ответственный;
	Иначе
		ДатаСреза     = ТекущаяДатаСеанса();
		Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
		
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ломбард.ПолучитьОбъект(),,ДатаСреза);
	СтруктураАдреса = фПрочитатьJSON(Ломбард.КонтактнаяИнформация[0].Значение);
	Структура.Вставить("Город",                         "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, ""));
	Структура.Вставить("Дата",                ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));
	Структура.Вставить("АдресОрганизации",              ?(ЗначениеЗаполнено(СведенияОбОрганизации.АдресОрганизации),
	                                                    СведенияОбОрганизации.АдресОрганизации, ""));
	Структура.Вставить("ИНН",                           ?(ЗначениеЗаполнено(Организация.ИНН), Организация.ИНН, ""));
	Структура.Вставить("ОГРН",                          ?(ЗначениеЗаполнено(Организация.ОГРН), Организация.ОГРН, ""));
	//Структура.Вставить("ПочтаОрганизации",              СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации);
	//Структура.Вставить("ТелефонОрганизации",            СведенияОбОрганизации.ТелефонОрганизации);
	
	Структура.Вставить("Ломбард",                       ?(ЗначениеЗаполнено(Ломбард), Строка(Ломбард), ""));
	Структура.Вставить("АдресЛомбарда",                 СтруктураАдреса.value);
	Структура.Вставить("ТелефонЛомбарда",               "");
	//Структура.Вставить("Дата",                          Формат(ДатаСреза, "ДФ=dd.MM.yyyy"));
	ДолжностьОтветственного                             = ДолжностьОтветственного(Ответственный, ДатаСреза);
	СклонениеДолжностиОтветственного                    = ПолучитьСклоненияСтроки(Строка(ДолжностьОтветственного), , "ПД=Родительный");
	//Структура.Вставить("ДолжностьОтветственногоВПадеже",     ?(ЗначениеЗаполнено(СклонениеДолжностиОтветственного[0]), 
	//                                                    НРег(?(СклонениеДолжностиОтветственного.Количество() > 0, СклонениеДолжностиОтветственного[0], "")), ""));
	Структура.Вставить("ДолжностьОтветственного",       ?(ЗначениеЗаполнено(ДолжностьОтветственного), Строка(ДолжностьОтветственного), ""));
	ФИООтветственного                                   = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	СклонениеФамилииОтветственного                      = ПолучитьСклоненияСтроки(ФамилияОтветственного, , "ПД=Родительный");
	ФамилияОтветственногоВПадеже                        = ?(СклонениеФамилииОтветственного.Количество() > 0, СклонениеФамилииОтветственного[0], "");
	
	//Структура.Вставить("ФамилияИнициалыОтветственногоВПадеже",ФамилияОтветственногоВПадеже + " " + ИнициалыОтветственного);
	Структура.Вставить("ФИООтветственного", ФамилияОтветственного + " " + ИнициалыОтветственного);
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("ТелефонКлиента",                ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Телефон), 
	                                                    КонтактнаяИнформацияКлиента.Телефон, ""));
	Структура.Вставить("ПочтаКлиента",                  ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Email),
	                                                                КонтактнаяИнформацияКлиента.Email, "нет"));
	Структура.Вставить("ФамилияИнициалыКлиента",        ДанныеКлиента.Фамилия + " " + Лев(ДанныеКлиента.Имя, 1) + "." + Лев(ДанныеКлиента.Отчество, 1) + ".");
	
	Возврат Структура;
КонецФункции

Функция ПолучитьДанныеДляПечатиСогласияНаОпробование(Клиент) Экспорт
	
	Структура = Новый Структура();
	
	
	ДатаСреза     = ТекущаяДата();
	Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ломбард.ПолучитьОбъект(),,ДатаСреза);
	СтруктураАдреса = фПрочитатьJSON(Ломбард.КонтактнаяИнформация[0].Значение);
	Структура.Вставить("Город",                         "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, ""));
	Структура.Вставить("Дата",                ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));
	Структура.Вставить("АдресОрганизации",              ?(ЗначениеЗаполнено(СведенияОбОрганизации.АдресОрганизации),
	                                                    СведенияОбОрганизации.АдресОрганизации, ""));
	Структура.Вставить("ИНН",                           ?(ЗначениеЗаполнено(Организация.ИНН), Организация.ИНН, ""));
	Структура.Вставить("ОГРН",                          ?(ЗначениеЗаполнено(Организация.ОГРН), Организация.ОГРН, ""));
	//Структура.Вставить("ПочтаОрганизации",              СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации);
	//Структура.Вставить("ТелефонОрганизации",            СведенияОбОрганизации.ТелефонОрганизации);
	
	Структура.Вставить("Ломбард",                       ?(ЗначениеЗаполнено(Ломбард), Строка(Ломбард), ""));
	Структура.Вставить("АдресЛомбарда",                 СтруктураАдреса.value);
	Структура.Вставить("ТелефонЛомбарда",               "");
	//Структура.Вставить("Дата",                          Формат(ДатаСреза, "ДФ=dd.MM.yyyy"));
	ДолжностьОтветственного                             = ДолжностьОтветственного(Ответственный, ДатаСреза);
	СклонениеДолжностиОтветственного                    = ПолучитьСклоненияСтроки(Строка(ДолжностьОтветственного), , "ПД=Родительный");
	//Структура.Вставить("ДолжностьОтветственногоВПадеже",     ?(ЗначениеЗаполнено(СклонениеДолжностиОтветственного[0]), 
	//                                                    НРег(?(СклонениеДолжностиОтветственного.Количество() > 0, СклонениеДолжностиОтветственного[0], "")), ""));
	Структура.Вставить("ДолжностьОтветственного",       ?(ЗначениеЗаполнено(ДолжностьОтветственного), Строка(ДолжностьОтветственного), ""));
	ФИООтветственного                                   = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	СклонениеФамилииОтветственного                      = ПолучитьСклоненияСтроки(ФамилияОтветственного, , "ПД=Родительный");
	ФамилияОтветственногоВПадеже                        = ?(СклонениеФамилииОтветственного.Количество() > 0, СклонениеФамилииОтветственного[0], "");
	
	//Структура.Вставить("ФамилияИнициалыОтветственногоВПадеже",ФамилияОтветственногоВПадеже + " " + ИнициалыОтветственного);
	Структура.Вставить("ФИООтветственного", ФамилияОтветственного + " " + ИнициалыОтветственного);
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	
	ДанныеПравоПребывания                               = ДанныеПравоПребывания(Клиент, ДатаСреза);
	
    Структура.Вставить("ДанныеПравоПребывания",         ?(ЗначениеЗаполнено(ДанныеПравоПребывания.ДанныеПравоПребывания),
		ДанныеПравоПребывания.ДанныеПравоПребывания + ". ", ""));
		
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("ТелефонКлиента",                ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Телефон), 
	                                                    КонтактнаяИнформацияКлиента.Телефон, ""));
	Структура.Вставить("ПочтаКлиента",                  ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Email),
	                                                                КонтактнаяИнформацияКлиента.Email, "нет"));
	Структура.Вставить("ФамилияИнициалыКлиента",        ДанныеКлиента.Фамилия + " " + Лев(ДанныеКлиента.Имя, 1) + "." + Лев(ДанныеКлиента.Отчество, 1) + ".");
	
	Возврат Структура;
КонецФункции

Функция ПолучитьДанныеДляПечатиСогласияНаОбработкуПД_ЗБ(ОперацияЗайма) Экспорт
	
	Структура = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаОбработкуПД_ЗБ.Период КАК Период,
		|	ЛБ_СогласияНаОбработкуПД_ЗБ.Клиент КАК Клиент,
		|	ЛБ_СогласияНаОбработкуПД_ЗБ.НомерЗБ КАК НомерЗБ,
		|	ЛБ_СогласияНаОбработкуПД_ЗБ.Ломбард КАК Ломбард,
		|	ЛБ_СогласияНаОбработкуПД_ЗБ.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаОбработкуПД_ЗБ КАК ЛБ_СогласияНаОбработкуПД_ЗБ
		|ГДЕ
		|	ЛБ_СогласияНаОбработкуПД_ЗБ.Период = &Период
		|	И ЛБ_СогласияНаОбработкуПД_ЗБ.Клиент = &Клиент
		|	И ЛБ_СогласияНаОбработкуПД_ЗБ.НомерЗБ = &НомерЗБ";
	
	Запрос.УстановитьПараметр("Клиент", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОперацияЗайма, "Залогодатель"));
	Запрос.УстановитьПараметр("НомерЗБ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОперацияЗайма, "НомерЗалоговогоБилета"));
	Запрос.УстановитьПараметр("Период", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОперацияЗайма, "Дата"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСреза     = Выборка.Период;
		Клиент        = Выборка.Клиент;
		НомерЗБ       = Выборка.НомерЗБ;
		Ломбард       = Выборка.Ломбард;
		Ответственный = Выборка.Ответственный;
	КонецЕсли;
		
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ломбард.ПолучитьОбъект(),,ДатаСреза);
	СтруктураАдреса = фПрочитатьJSON(Ломбард.КонтактнаяИнформация[0].Значение);
	Структура.Вставить("Город",                         "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, ""));
	Структура.Вставить("Дата",                ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));
	Структура.Вставить("АдресОрганизации",              ?(ЗначениеЗаполнено(СведенияОбОрганизации.АдресОрганизации),
	                                                    СведенияОбОрганизации.АдресОрганизации, ""));
	Структура.Вставить("ИНН",                           ?(ЗначениеЗаполнено(Организация.ИНН), Организация.ИНН, ""));
	Структура.Вставить("ОГРН",                          ?(ЗначениеЗаполнено(Организация.ОГРН), Организация.ОГРН, ""));
	//Структура.Вставить("ПочтаОрганизации",              СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации);
	//Структура.Вставить("ТелефонОрганизации",            СведенияОбОрганизации.ТелефонОрганизации);
	
	Структура.Вставить("Ломбард",                       ?(ЗначениеЗаполнено(Ломбард), Строка(Ломбард), ""));
	Структура.Вставить("АдресЛомбарда",                 СтруктураАдреса.value);
	Структура.Вставить("ТелефонЛомбарда",               "");
	Структура.Вставить("НомерЗБ",                       НомерЗБ);
	Структура.Вставить("ДатаЗБ",                        Формат(ДатаСреза, "ДФ=dd.MM.yyyy"));
	ДолжностьОтветственного                             = ДолжностьОтветственного(Ответственный, ДатаСреза);
	СклонениеДолжностиОтветственного                    = ПолучитьСклоненияСтроки(Строка(ДолжностьОтветственного), , "ПД=Родительный");
	//Структура.Вставить("ДолжностьОтветственногоВПадеже",     ?(ЗначениеЗаполнено(СклонениеДолжностиОтветственного[0]), 
	//                                                    НРег(?(СклонениеДолжностиОтветственного.Количество() > 0, СклонениеДолжностиОтветственного[0], "")), ""));
	Структура.Вставить("ДолжностьОтветственного",       ?(ЗначениеЗаполнено(ДолжностьОтветственного), Строка(ДолжностьОтветственного), ""));
	ФИООтветственного                                   = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	СклонениеФамилииОтветственного                      = ПолучитьСклоненияСтроки(ФамилияОтветственного, , "ПД=Родительный");
	ФамилияОтветственногоВПадеже                        = ?(СклонениеФамилииОтветственного.Количество() > 0, СклонениеФамилииОтветственного[0], "");
	
	//Структура.Вставить("ФамилияИнициалыОтветственногоВПадеже",ФамилияОтветственногоВПадеже + " " + ИнициалыОтветственного);
	Структура.Вставить("ФИООтветственного", ФамилияОтветственного + " " + ИнициалыОтветственного);
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	
	ДанныеПравоПребывания                               = ДанныеПравоПребывания(Клиент, ДатаСреза);
	
    Структура.Вставить("ДанныеПравоПребывания",         ?(ЗначениеЗаполнено(ДанныеПравоПребывания.ДанныеПравоПребывания),
		ДанныеПравоПребывания.ДанныеПравоПребывания + ". ", ""));
			
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("ТелефонКлиента",                ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Телефон), 
	                                                    КонтактнаяИнформацияКлиента.Телефон, ""));
	Структура.Вставить("ПочтаКлиента",                  ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Email),
	                                                                КонтактнаяИнформацияКлиента.Email, "нет"));
	Структура.Вставить("ФамилияИнициалыКлиента",        ДанныеКлиента.Фамилия + " " + Лев(ДанныеКлиента.Имя, 1) + "." + Лев(ДанныеКлиента.Отчество, 1) + ".");
	
	Возврат Структура;
КонецФункции

Функция ДолжностьОтветственного(Сотрудник, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Должность;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ДанныеКлиента(Залогодатель, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура;
        Структура.Вставить("Фамилия",      Выборка.Фамилия);
        Структура.Вставить("Имя",          Выборка.Имя);
        Структура.Вставить("Отчество",     Выборка.Отчество);
        Структура.Вставить("ДатаРождения", Выборка.ДатаРождения);
		Возврат Структура;
	Иначе
		Структура = Новый Структура;
        Структура.Вставить("Фамилия",      "");
        Структура.Вставить("Имя",          "");
        Структура.Вставить("Отчество",     "");
        Структура.Вставить("ДатаРождения", "");
		Возврат Структура;
    КонецЕсли;		
КонецФункции

Функция КонтактнаяИнформацияКлиента(Залогодатель, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура;
        Структура.Вставить("Телефон",          Выборка.Телефон);
        Структура.Вставить("Email",            Выборка.Email);
        Структура.Вставить("АдресПоПрописке",  Выборка.АдресПоПрописке);
        Структура.Вставить("ФактическийАдрес", Выборка.ФактическийАдрес);
		Возврат Структура;
	Иначе
		Структура = Новый Структура;
        Структура.Вставить("Телефон",          "");
        Структура.Вставить("Email",            "");
        Структура.Вставить("АдресПоПрописке",  "");
        Структура.Вставить("ФактическийАдрес", "");
		Возврат Структура;
    КонецЕсли;		
КонецФункции

Функция ПаспортныеДанныеКлиента(Залогодатель, Дата, ДокументСПрописнойБуквы = Ложь)
	
	Результат = Новый Структура("ПаспортныеДанные, ВидДокумента, Серия, Номер, КемВыдан,
		|ДатаВыдачи, КодПодразделения", "", "", "", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.Представление КАК ВидДокумента,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА """"
		|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи
		|	КОНЕЦ КАК ДатаВыдачи,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения,
		|	ВЫБОР
		|		КОГДА ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство.Код = ""643""
		|			ТОГДА """"
		|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство
		|	КОНЕЦ КАК Гражданство
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		|ГДЕ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя = &ДУЛ
		|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен
		|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ";
	
	Запрос.УстановитьПараметр("ДУЛ", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		ВидДокументаВыборка = ?(ДокументСПрописнойБуквы, СтрШаблон("%1%2", НРег(Лев(Выборка.ВидДокумента, 1)),
			Сред(Выборка.ВидДокумента, 2)), Выборка.ВидДокумента);
		
		Гражданство      = ?(ПустаяСтрока(Выборка.Гражданство),      "", "Гражданство: " +                    Строка(Выборка.Гражданство) + ", ");
		ВидДокумента     = ?(ПустаяСтрока(ВидДокументаВыборка),      "", СтрШаблон(" %1:",                    ВидДокументаВыборка));
		Серия            = ?(ПустаяСтрока(Выборка.Серия),            "", СтрШаблон(" серия %1",              Выборка.Серия));
		Номер            = ?(ПустаяСтрока(Выборка.Номер),            "", СтрШаблон(" номер %1",               Выборка.Номер));
		КемВыдан         = ?(ПустаяСтрока(Выборка.КемВыдан),         "", СтрШаблон(", выдан: %1",             Выборка.КемВыдан));
		ДатаВыдачи       = ?(ПустаяСтрока(Выборка.ДатаВыдачи),       "", СтрШаблон(", дата выдачи: %1",       Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")));
		КодПодразделения = ?(ПустаяСтрока(Выборка.КодПодразделения), "", СтрШаблон(", код подразделения: %1", Выборка.КодПодразделения)); 
		
		Результат.Вставить("ПаспортныеДанные", СтрШаблон("%1%2%3%4%5%6%7", Гражданство,
			ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения));
		
		Результат.Вставить("Гражданство",      Выборка.Гражданство);
		Результат.Вставить("ВидДокумента",     Выборка.ВидДокумента);
		Результат.Вставить("Серия",            Выборка.Серия);
		Результат.Вставить("Номер",            Выборка.Номер);
		Результат.Вставить("КемВыдан",         Выборка.КемВыдан);
		Результат.Вставить("ДатаВыдачи",       Выборка.ДатаВыдачи);
		Результат.Вставить("КодПодразделения", Выборка.КодПодразделения);
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ДанныеПравоПребывания(Залогодатель, Дата, ДокументСПрописнойБуквы = Ложь)
	
	Результат = Новый Структура("ДанныеПравоПребывания, ВидДокумента, Серия, Номер, КемВыдан,
		|ДатаВыдачи, КодПодразделения", "", "", "", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.Представление КАК ВидДокумента,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА """"
		|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи
		|	КОНЕЦ КАК ДатаВыдачи,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		|ГДЕ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя = &ДУЛ
		|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен
		|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДоп";
	
	Запрос.УстановитьПараметр("ДУЛ", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		ВидДокументаВыборка = ?(ДокументСПрописнойБуквы, СтрШаблон("%1%2", НРег(Лев(Выборка.ВидДокумента, 1)),
			Сред(Выборка.ВидДокумента, 2)), Выборка.ВидДокумента);
		
		ВидДокумента     = ?(ПустаяСтрока(ВидДокументаВыборка),      "", СтрШаблон(" %1:",                    ВидДокументаВыборка));
		Серия            = ?(ПустаяСтрока(Выборка.Серия),            "", СтрШаблон(" серия %1",               Выборка.Серия));
		Номер            = ?(ПустаяСтрока(Выборка.Номер),            "", СтрШаблон(" номер %1",               Выборка.Номер));
		КемВыдан         = ?(ПустаяСтрока(Выборка.КемВыдан),         "", СтрШаблон(", выдан: %1",             Выборка.КемВыдан));
		ДатаВыдачи       = ?(ПустаяСтрока(Выборка.ДатаВыдачи),       "", СтрШаблон(", дата выдачи: %1",       Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")));
		КодПодразделения = ?(ПустаяСтрока(Выборка.КодПодразделения), "", СтрШаблон(", код подразделения: %1", Выборка.КодПодразделения)); 
		
		Результат.Вставить("ДанныеПравоПребывания", СтрШаблон("%1%2%3%4%5%6", ВидДокумента, Серия, Номер,
			КемВыдан, ДатаВыдачи, КодПодразделения));
		
		Результат.Вставить("ВидДокумента",     Выборка.ВидДокумента);
		Результат.Вставить("Серия",            Выборка.Серия);
		Результат.Вставить("Номер",            Выборка.Номер);
		Результат.Вставить("КемВыдан",         Выборка.КемВыдан);
		Результат.Вставить("ДатаВыдачи",       Выборка.ДатаВыдачи);
		Результат.Вставить("КодПодразделения", Выборка.КодПодразделения);
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция фПрочитатьJSON(ТекстJSON) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Структура = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
	Чтение.Закрыть();
	Возврат Структура;
КонецФункции

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	Результат = Новый Структура;

	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			Возврат Результат;
			ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);
		КонецЕсли;
	КонецЦикла;  
		
	Возврат Результат;
КонецФункции

Функция ЗаполнитьМассивИзОтветаJSON(Знач Чтение)
	Результат = Новый Массив;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта Тогда 
			Результат.Добавить(ЗаполнитьСтруктуруИзОтветаJSON(Чтение));
		ИначеЕсли Тип = ТипЗначенияJSON.КонецМассива Тогда 
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции

#КонецОбласти

Функция НаличиеДействующегоСогласия(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Статус КАК Статус,
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаОбработкуПД.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ЛБ_СогласияНаОбработкуПДСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураВозврата = Новый Структура;
	
	Если Выборка.Следующий() Тогда
		Статус = Выборка.Статус;
		Если Статус = Перечисления.ЛБ_СтатусыСоглашенийПД.Получено Тогда
			СтруктураВозврата.Вставить("Результат", Истина);
			СтруктураВозврата.Вставить("Период", Выборка.Период);
		Иначе
			СтруктураВозврата.Вставить("Результат", Ложь);
		КонецЕсли;
	Иначе
		СтруктураВозврата.Вставить("Результат", Ложь);
	КонецЕсли;	
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ПериодОтзываСогласия(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаОбработкуПДСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаОбработкуПД.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И Статус = &Статус
		|				И НЕ Ошибочное) КАК ЛБ_СогласияНаОбработкуПДСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСоглашенийПД.Отозвано);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаОтзыва = Выборка.Период;
	Иначе
		ДатаОтзыва = Дата(1,1,1);
	КонецЕсли;
	
	Возврат ДатаОтзыва;
	
КонецФункции

Функция ЗаключитьСогласиеНаОбработкуПД(Клиент, Период) Экспорт
	Попытка	
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаОбработкуПД.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = Период;
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийПД.Получено;
		МенеджерЗаписи.Основание     = "Получено согласие на обработку ПДн";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	Возврат РезультатЗаключения;
КонецФункции // ЗаключитьСогласиеНаОбработкуПД()

Функция ЗаключитьСогласиеНаОбработкуПД_ЗБ(ОперацияЗайма) Экспорт
	Попытка	
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаОбработкуПД_ЗБ.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ОперацияЗайма.Дата;
		МенеджерЗаписи.НомерЗБ       = ОперацияЗайма.НомерЗалоговогоБилета;
		МенеджерЗаписи.Клиент        = ОперацияЗайма.Залогодатель;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийПД.Получено;
		МенеджерЗаписи.Основание     = "Получено согласие на обработку ПДн";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	Возврат РезультатЗаключения;
КонецФункции // ЗаключитьСогласиеНаОбработкуПД_ЗБ()

Функция ОтозватьСогласиеПД(Клиент, Комментарий = Неопределено) Экспорт
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаОбработкуПД.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийПД.Отозвано;
		Если Комментарий <> Неопределено Тогда
			МенеджерЗаписи.Ломбард       = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
			МенеджерЗаписи.Основание     = "Отозвано согласие на обработку персональных данных (ЦО)";
			МенеджерЗаписи.Комментарий   = Комментарий;
		Иначе
			МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
			МенеджерЗаписи.Основание     = "Отозвано согласие на обработку персональных данных";
		КонецЕсли;
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	Возврат РезультатЗаключения;
КонецФункции 

Процедура УдалитьСогласиеНаОбработкуПД(Клиент, Период) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЛБ_СогласияНаОбработкуПД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Запись.Ошибочное = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаОбработкуПД.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата() + 1;
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСоглашенийПД.НеПолучено;
		МенеджерЗаписи.Основание     = "Удалено полученное согласие на обработку ПДн";
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры
